# Series datatype
- It is like numpy 1d array with labels
- It supports all statistical operations
#### Creation of Series
- from list/tuple/range/1d array
- from dataframe

In [1]:
import pandas as pd

In [9]:
#s=pd.Series([10,20,30])
#s=pd.Series([10,20,30],name='Roll')
s=pd.Series([20,10,30],name='Roll',index=['a','b','c'])
s

a    20
b    10
c    30
Name: Roll, dtype: int64

In [4]:
[10,20,30]

[10, 20, 30]

In [10]:
print(s.sum())
print(s.mean())
print(s.min())
print(s.max())
print(s.count())
print(s.median())
print(s.sort_values())

60
20.0
10
30
3
20.0
b    10
a    20
c    30
Name: Roll, dtype: int64

In [13]:
#how to fetch only values from series
#series.values-->returns numpy 1d array of all values 
s.values

array([20, 10, 30], dtype=int64)

In [14]:
#how to fetch only indexes from series
#series.index--->returns 1d array like of all indexes
s.index

Index(['a', 'b', 'c'], dtype='object')

In [15]:
#how to fetch name of series
s.name

'Roll'

In [16]:
df=pd.read_csv('f:/dataset/analysis/restaurant.csv')
df

     total_bill   tip  gender smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

# how to fetch a column from dataframe
- ##### series=df.columnname
- ##### series=df['columnname']

In [17]:
s=df.total_bill
type(s)

pandas.core.series.Series

In [18]:
s

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [19]:
s=df['total_bill']
s

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [20]:
df

     total_bill   tip  gender smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

# DataFrame Attributes

In [21]:
df.shape #(rows,cols)

(244, 7)

In [22]:
df.size #total values

1708

In [23]:
df.dtypes #datatype of values for each column

total_bill    float64
tip           float64
gender         object
smoker         object
day            object
time           object
size            int64
dtype: object

In [24]:
df.total_bill

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [25]:
df.size

1708

In [26]:
df['size']

0      2
1      3
2      3
3      2
4      4
      ..
239    3
240    2
241    2
242    2
243    2
Name: size, Length: 244, dtype: int64

In [27]:
df

     total_bill   tip  gender smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [28]:
df.total_bill.sum()

4827.77

In [29]:
df.total_bill.mean()

19.78594262295082

In [30]:
df.total_bill.max()

50.81

In [31]:
df.total_bill.min()

3.07

In [32]:
df.gender.unique()

array(['Female', 'Male'], dtype=object)

In [33]:
df.gender.value_counts()

gender
Male      157
Female     87
Name: count, dtype: int64

In [34]:
df.time.value_counts()

time
Dinner    176
Lunch      68
Name: count, dtype: int64

In [35]:
df.day.value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

# dataframe conditional slicing
- ##### newdf=df[condition]

In [36]:
df[df.time=='Dinner']

     total_bill   tip  gender smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[176 rows x 7 columns]

In [39]:
df[(df.time=='Dinner') & (df.gender=='Female')].shape

(52, 7)

In [40]:
df[df.time=='Dinner'].gender.value_counts()

gender
Male      124
Female     52
Name: count, dtype: int64

In [41]:
df

     total_bill   tip  gender smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [42]:
df=pd.read_csv('f:/dataset/analysis/titanic.csv')
df

,PassengerId,Survived,Pclass,Name,gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [43]:
df.Survived.value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [44]:
342/891

0.3838383838383838

In [45]:
549/891

0.6161616161616161

In [47]:
df[df.Survived==1].Pclass.value_counts()

Pclass
1    136
3    119
2     87
Name: count, dtype: int64

In [48]:
df.Pclass.value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [49]:
136/216

0.6296296296296297

In [50]:
87/184

0.47282608695652173

In [51]:
119/491

0.24236252545824846

In [52]:
df.gender.value_counts()

gender
male      577
female    314
Name: count, dtype: int64

In [53]:
df[df.Survived==1].gender.value_counts()

gender
female    233
male      109
Name: count, dtype: int64

In [54]:
109/577

0.18890814558058924

In [56]:
233/314

0.7420382165605095

In [57]:
df[(df.Survived==1) & (df.Pclass==1)].gender.value_counts()

gender
female    91
male      45
Name: count, dtype: int64

In [58]:
df[(df.Pclass==1)].gender.value_counts()

gender
male      122
female     94
Name: count, dtype: int64

In [60]:
df[df.Age>=70].shape

(7, 12)

In [61]:
df[df.Age>=70].Survived.value_counts()

Survived
0    6
1    1
Name: count, dtype: int64

In [62]:
df[df.Age>=70]

,PassengerId,Survived,Pclass,Name,gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.0,0,0,C.A. 24580,10.5000,NaN,S
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0000,B22,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

In [65]:
df[df.Age<=5].Survived.value_counts()

Survived
1    31
0    13
Name: count, dtype: int64

In [66]:
df[(df.SibSp==0) & (df.Parch==0)].Survived.value_counts()

Survived
0    374
1    163
Name: count, dtype: int64

# How to find main characterstics/summary of data quickly

In [67]:
df=pd.read_csv('f:/dataset/analysis/restaurant.csv')
df

     total_bill   tip  gender smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [69]:
res_df=df.describe()

In [70]:
res_df.to_excel('rest.xlsx',sheet_name='summary')

In [72]:
df.describe(include='object')

       gender smoker  day    time
count     244    244  244     244
unique      2      2    4       2
top      Male     No  Sat  Dinner
freq      157    151   87     176

In [73]:
df.describe(include='all')

        total_bill         tip gender smoker  day    time        size
count   244.000000  244.000000    244    244  244     244  244.000000
unique         NaN         NaN      2      2    4       2         NaN
top            NaN         NaN   Male     No  Sat  Dinner         NaN
freq           NaN         NaN    157    151   87     176         NaN
mean     19.785943    2.998279    NaN    NaN  NaN     NaN    2.569672
std       8.902412    1.383638    NaN    NaN  NaN     NaN    0.951100
min       3.070000    1.000000    NaN    NaN  NaN     NaN    1.000000
25%      13.347500    2.000000    NaN    NaN  NaN     NaN    2.000000
50%      17.795000    2.900000    NaN    NaN  NaN     NaN    2.000000
75%      24.127500    3.562500    NaN    NaN  NaN     NaN    3.000000
max      50.810000   10.000000    NaN    NaN  NaN     NaN    6.000000